Tekla Open API Reference for Tekla Structures 2025
ArrowheadAttributes Properties
The ArrowheadAttributes type exposes the following members.
Properties
Name | Description
ArrowPosition
 The position of the arrowhead. The position is always ArrowheadPositions.Both for dimensions.
Head
 The type of the arrowhead.
Height
 The height of the arrowhead.
Width
 The width of the arrowhead.
Top
See Also
Reference
ArrowheadAttributes Class
Tekla.Structures.Drawing Namespace